nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/devcon/processor/devcon_p32mx150f128b.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _DEVCON_P32MX150F128B_H
#define _DEVCON_P32MX150F128B_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    DEVCON_ID_0 = 0,
    DEVCON_NUMBER_OF_MODULES

} DEVCON_MODULE_ID;

typedef enum {

    DEVCON_CFGLOCK_NONE

} DEVCON_CFGLOCK;

PLIB_INLINE SFR_TYPE* _DEVCON_PPS_LOCK_MX_VREG(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return &CFGCON;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DEVCON_PMD_LOCK_MX_VREG(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return &CFGCON;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DEVCON_JTAG_ENABLE_VREG(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return &CFGCON;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DEVCON_JTAG_TDO_USE_ENABLE_VREG(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return &CFGCON;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DEVCON_DEVICE_REVISION_VREG(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return &DEVID;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DEVCON_DEVICE_ID_VREG(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return &DEVID;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DEVCON_SYS_LOCK_VREG(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return &SYSKEY;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_PPS_LOCK_MX_MASK(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_IOLOCK_MASK;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_PMD_LOCK_MX_MASK(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_PMDLOCK_MASK;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_JTAG_ENABLE_MASK(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_JTAGEN_MASK;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_JTAG_TDO_USE_ENABLE_MASK(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_TDOEN_MASK;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_DEVICE_REVISION_MASK(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _DEVID_VER_MASK;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_DEVICE_ID_MASK(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _DEVID_DEVID_MASK;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_SYS_LOCK_MASK(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return (SFR_DATA)-1;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_PPS_LOCK_MX_POS(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_IOLOCK_POSITION;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_PMD_LOCK_MX_POS(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_PMDLOCK_POSITION;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_JTAG_ENABLE_POS(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_JTAGEN_POSITION;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_JTAG_TDO_USE_ENABLE_POS(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_TDOEN_POSITION;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_DEVICE_REVISION_POS(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _DEVID_VER_POSITION;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_DEVICE_ID_POS(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _DEVID_DEVID_POSITION;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_SYS_LOCK_POS(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return (SFR_DATA)0;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_PPS_LOCK_MX_LEN(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_IOLOCK_LENGTH;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_PMD_LOCK_MX_LEN(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_PMDLOCK_LENGTH;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_JTAG_ENABLE_LEN(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_JTAGEN_LENGTH;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_JTAG_TDO_USE_ENABLE_LEN(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _CFGCON_TDOEN_LENGTH;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

