nyh-workshop/sk1632-i2s-dma/v1_07_01/framework/peripheral/devcon/processor/devcon_p32mx150f128b.h
PLIB_INLINE SFR_DATA _DEVCON_DEVICE_REVISION_LEN(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _DEVID_VER_LENGTH;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_DEVICE_ID_LEN(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return _DEVID_DEVID_LENGTH;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DEVCON_SYS_LOCK_LEN(DEVCON_MODULE_ID i)
{
    switch (i) {
        case DEVCON_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/devcon_AlternateClock_Unsupported.h"
#include "../templates/devcon_DeviceRegsLockUnlock_PIC32MX.h"
#include "../templates/devcon_OTPConfigLockUnlock_Unsupported.h"
#include "../templates/devcon_USB_PHY_SleepModeSet_Unsupported.h"
#include "../templates/devcon_ECCModes_Unsupported.h"
#include "../templates/devcon_JTAGEnable_Default.h"
#include "../templates/devcon_AnalogChargePumpControl_Unsupported.h"
#include "../templates/devcon_TraceOutput_Unsupported.h"
#include "../templates/devcon_JTAGUsesTDO_Default.h"
#include "../templates/devcon_IgnoreDebugFreeze_Unsupported.h"
#include "../templates/devcon_DeviceVerAndId_Default.h"
#include "../templates/devcon_SysLockUnlock_Default.h"
#include "../templates/devcon_MPLL_Unsupported.h"
#include "../templates/devcon_HSUARTControl_Unsupported.h"
#include "../templates/devcon_BootSelection_Unsupported.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_DEVCON_AlternateClockEnable(DEVCON_MODULE_ID index, DEVCON_ALT_CLOCK_TARGET targetAltClock)
{
    switch (index) {
        case DEVCON_ID_0 :
            DEVCON_AlternateClockEnable_Unsupported(index, targetAltClock);
            break;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_DEVCON_AlternateClockDisable(DEVCON_MODULE_ID index, DEVCON_ALT_CLOCK_TARGET targetAltClock)
{
    switch (index) {
        case DEVCON_ID_0 :
            DEVCON_AlternateClockDisable_Unsupported(index, targetAltClock);
            break;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DEVCON_ExistsAlternateClock(DEVCON_MODULE_ID index)
{
    switch (index) {
        case DEVCON_ID_0 :
            return DEVCON_ExistsAlternateClock_Unsupported(index);
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DEVCON_DeviceRegistersLock(DEVCON_MODULE_ID index, DEVCON_REGISTER_SET registersToLock)
{
    switch (index) {
        case DEVCON_ID_0 :
            DEVCON_DeviceRegistersLock_PIC32MX(index, registersToLock);
            break;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_DEVCON_DeviceRegistersUnlock(DEVCON_MODULE_ID index, DEVCON_REGISTER_SET registersToLock)
{
    switch (index) {
        case DEVCON_ID_0 :
            DEVCON_DeviceRegistersUnlock_PIC32MX(index, registersToLock);
            break;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DEVCON_ExistsDeviceRegsLockUnlock(DEVCON_MODULE_ID index)
{
    switch (index) {
        case DEVCON_ID_0 :
            return DEVCON_ExistsDeviceRegsLockUnlock_PIC32MX(index);
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_DEVCON_OTPConfigLock(DEVCON_MODULE_ID index, DEVCON_CFGLOCK lockType)
{
    switch (index) {
        case DEVCON_ID_0 :
            DEVCON_OTPConfigLock_Unsupported(index, lockType);
            break;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_DEVCON_OTPConfigUnlock(DEVCON_MODULE_ID index)
{
    switch (index) {
        case DEVCON_ID_0 :
            DEVCON_OTPConfigUnlock_Unsupported(index);
            break;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DEVCON_ExistsOTPConfigLockUnlock(DEVCON_MODULE_ID index)
{
    switch (index) {
        case DEVCON_ID_0 :
            return DEVCON_ExistsOTPConfigLockUnlock_Unsupported(index);
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_DEVCON_USBPHYSleepModeSet(DEVCON_MODULE_ID index, DEVCON_USB_SLEEP_MODE sleepOrRun)
{
    switch (index) {
        case DEVCON_ID_0 :
            DEVCON_USBPHYSleepModeSet_Unsupported(index, sleepOrRun);
            break;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DEVCON_ExistsUSB_PHY_SleepModeSet(DEVCON_MODULE_ID index)
{
    switch (index) {
        case DEVCON_ID_0 :
            return DEVCON_ExistsUSB_PHY_SleepModeSet_Unsupported(index);
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_DEVCON_FlashErrCorrectionModeSet(DEVCON_MODULE_ID index, DEVCON_ECC_CONFIG flashECC)
{
    switch (index) {
        case DEVCON_ID_0 :
            DEVCON_FlashErrCorrectionModeSet_Unsupported(index, flashECC);
            break;
        case DEVCON_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DEVCON_ExistsECCModes(DEVCON_MODULE_ID index)
{
    switch (index) {
        case DEVCON_ID_0 :
            return DEVCON_ExistsECCModes_Unsupported(index);
        case DEVCON_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

